package com.test;

import org.springframework.context.ApplicationContext;
import org.springframework.context.support.ClassPathXmlApplicationContext;

import java.util.Random;
import com.dao.UsersDAO;
import com.entity.Users;
import com.util.VeDate;

//用于生成测试用户的类
public class UserTest {

	@SuppressWarnings("resource")
	public static void main(String[] args) {
		ApplicationContext resource = new ClassPathXmlApplicationContext("springmvc-servlet.xml");
		UsersDAO usersDAO = (UsersDAO) resource.getBean(UsersDAO.class);
		String[] realname = { "郑伊雯", "雷进宝", "吴美隆", "吴心真", "王美珠", "郭芳天", "李雅惠", "陈文婷", "曹敏侑", "王依婷", "陈婉璇", "吴美玉", "蔡依婷",
				"郑昌梦", "林家纶", "黄丽昆", "李育泉", "黄芸欢", "吴韵如", "李肇芬", "卢木仲", "李成白", "方兆玉", "刘翊惠", "丁汉臻", "吴佳瑞", "舒绿珮", "周白芷",
				"张姿妤", "张虹伦", "周琼玟", "倪怡芳", "郭贵妃", "杨佩芳", "黄文旺", "黄盛玫", "郑丽青", "许智云", "张孟涵", "李小爱", "王恩龙", "朱政廷", "邓诗涵",
				"陈政倩", "吴俊伯", "阮馨学", "翁惠珠", "吴思翰", "林佩玲", "邓海来", "陈翊依", "李建智", "武淑芬", "金雅琪", "赖怡宜", "黄育霖", "张仪湖", "王俊民",
				"张诗刚", "林慧颖", "沈俊君", "陈淑妤", "李姿伶", "高咏钰", "黄彦宜", "周孟儒", "潘欣臻", "李祯韵", "叶洁启", "梁哲宇", "黄晓萍", "杨雅萍", "卢志铭",
				"张茂以", "林婉婷", "蔡宜芸", "林珮瑜", "黄柏仪", "周逸珮", "夏雅惠", "王采珮", "林孟霖", "林竹水", "王怡乐", "王爱乐", "金佳蓉", "韩健毓", "李士杰",
				"陈萱珍", "苏姿婷", "张政霖", "李志宏", "陈素达", "陈虹荣", "何美玲", "李仪琳", "张俞幸", "黄秋萍", "潘吉维", "陈智筠", "蔡国伟", "连俊达", "李雅婷",
				"李礼娇", "李忆孝", "黄静雯", "陈淳宝", "李文育", "林佳蓉", "罗依茂", "李淑佩", "谢怡君", "王美玲", "黄慧学", "邓幸韵", "陈秀琬", "许岳平", "许爱礼",
				"谢一忠", "简志雪", "赵若喜", "许承翰", "姚哲维", "苏俊安", "郭礼钰", "姜佩珊", "张鸿信", "秦欣瑜", "李旺劭", "陈怡爱", "陈秀德", "张佳伶", "郑凯婷",
				"郑雅任", "黄国妹", "林芳江", "江骏生", "黄儒纯", "王培伦", "陈蕙侑", "蔡宜慧", "陈信意", "陈惠雯", "张琇纶", "黄碧仪", "陈志文", "谢懿富", "杨凡靖",
				"蔡秀琴", "温惠玲", "林宗其", "林绍泰", "何佳慧", "蔡辰纶", "王雅雯", "叶怡财", "冯雅筑", "李伦圣", "彭正仁", "刘小紫", "温燕达", "刘佳雨", "吴婷婷",
				"杨怡君", "黄康刚", "林辰和", "陈世人", "吴佩霖", "张伟杰", "刘友淳", "张瑞群", "洪紫芬", "邓家伟", "谢佩任", "戎郁文", "李治火", "林石美", "郑雅茜",
				"胡台泰", "陈怡盈", "阙石意", "林盈威", "林志嘉", "李秀玲", "王彦霖", "叶惟芷", "郑星钰", "邱贞伟", "姚扬云", "涂武盛", "王雅顺", "唐欣仪", "陈政圣",
				"陈育福", "吴惠雯", "李淑淑", "黄莉秋", "赖俊军", "荆彦璋", "白怡均", "林姿辛", "林雅慧", "詹允坚", "赖淑珍", "吴惠美", "李凯婷", "林承辰", "刘亭宝",
				"宋慧元", "连书忠", "余仪礼", "袁哲仪", "杜怡臻", "潘孝东", "周志合", "刘力霞", "林钰婷", "林怡紫", "林俊凯", "蔡于纬", "蔡雅惠", "汪喜祥", "陈铭侑",
				"郭子珠", "许伦吉", "陈佳雨", "赖英贤", "吴嘉茹", "陈永桂", "张文宏", "唐欣怡", "丁绍燕", "王雅谕", "叶柏宇", "王婉萍", "王宗清", "刘心霖", "吴柏廷",
				"陈怡臻", "杜士豪", "李春勋", "黄雅慧", "吴乔茂", "郑婉如", "李育坚", "黄静雯", "赵一蓉", "邱萱俐", "周立妹", "李宝其", "张信豪", "李昆霖", "陈俊安",
				"林建志", "黄韦伶", "李美麟", "张政达", "郑惠玲", "柳忠廷", "黄美娟", "许怡君", "吴崇南", "邱承芷", "叶得梅", "陈祯月", "杨宛儒", "阮肇宪", "杨益霞",
				"唐盛人", "许平纬", "许雅如", "林秀绮", "刘昌东", "张家荣", "杨淑君", "吴俊民", "李彦瑜", "李彦文", "王崇以", "王威全", "彭琳以", "许志任", "陈嘉杰",
				"蔡志远", "陈信文", "陈思廷", "吴家毓", "李宜紫", "杨毅民", "林志平", "陈伟孝", "刘信俊", "李美治", "徐景隆", "刘怡洁", "陈钰梦", "谢静宜", "戴惠如",
				"王香君", "钟汉馨", "郑国玮", "张哲亚", "詹南勋", "潘秋福", "黄奕君", "郭琬婷", "冯家华", "吴佩仁", "周思颖", "张柏钧", "吴世伟", "朱佳琪", "陈宗馨",
				"黄菁坚", "郑建泉", "许金志", "平信宏", "蔡佳麟", "杨佳宏", "陈皓雅", "吴翊意", "张佩珊", "温欣桦", "王诗铭", "许宜辰", "林孟哲", "黄善宇", "王怡贵",
				"许淑玫", "张学玉", "黄美珍", "陈佳心", "宋其琪", "陈致昀", "王建福", "刘莹睿", "陈正莲", "冯萱雨", "金淑敏", "宋廷意", "吴承华", "陈家莲", "王志源",
				"张佩君", "黄志伟", "吴孟吟", "蔡玮玉", "张心怡", "吴志绿", "何武霖", "杨中惟", "王佑诚", "徐承财", "温伟伦", "萧郁婷", "陈世伟", "林敬书", "谢孟南",
				"项宜真", "崔美珠", "赖筱雯", "陈盛丰", "阮升云", "周怡季", "江佳芸", "郭惠君", "吕智文", "王琼龙", "陈姿茜", "张佩君", "李佩纬", "黄珮心", "李旭友",
				"王健以", "蔡幸弘", "刘智钧", "张佳颖", "郭东欣", "黄志忠", "李娇郁", "许欣怡", "杜劭依", "荣美君", "陈翠昆", "陈昆绍", "黄志佩", "黄舜文", "刘丽卿",
				"张倩纬", "施珮昆", "郑纬水", "林明玫", "郑琦希", "童家贤", "郭峻豪", "林雅豪", "曲祯妹", "林冠宇", "陈珍莹", "简玟君", "杜阳吟", "许雅菱", "叶木书",
				"黄文其", "陈景彦", "蒋承凯", "黄依萍", "黄珮秋", "郑文贤", "柯元燕", "李思雄", "王绍玉", "金尧珊", "李政绍", "叶法盛", "苏琪山", "邱思妤", "王若芳",
				"黎彦君", "冷翊瑜", "张明真", "李琪源", "林素侑", "孟敏宇", "怀雅惠", "吴士弘", "张世志", "袁志铭", "林千惠", "宋乐男", "黄淑贞", "王宗盛", "吴永臻",
				"陈富财", "钱孟儒", "谢百宜", "曹振豪", "陈品妃", "吴升财", "陈昀雪", "高淑娟", "林智钧", "林秋平", "王汉季", "黄仁添", "詹雅如", "蔡佳麟", "张美君",
				"孙姿吟", "陈孟善", "黄美君", "林盈秀", "王姿雯", "王旻峰", "郭淑卿", "谢盈冰", "魏淑华", "刘志宜", "张怡婷", "梁淑敏", "王白木", "方劭中", "田火劭",
				"叶佩正", "程巧欢", "陈玮弘", "张毅琳", "吴念筠", "张美惠", "陈欣白", "李怡文", "曹珊贵", "梁家豪", "洪月瑄", "李铭茹", "金杰蕙", "杨冠霖", "吴明宜",
				"陆怡雯", "黄立启", "林雅芸", "林佩毓", "李宜珊", "钱怡伶", "刘宗翰", "林台斌", "杨杰均", "连育如", "杨奕名", "郭玉婷", "王翊谦", "彭圣杰", "郑世杰",
				"吴承翰", "张琦芸", "邓淑芬", "陈佳芳", "吴秋良", "陈舜文", "蔡靖玮", "林雅舜", "张真勇", "邱益勇", "林懿淳", "郭美慧", "蔡智强", "张智苹", "陈冰茹",
				"李思纬", "郑馨仪", "程明辉", "陈弘善", "陈政勋", "卢琬杰", "黄柏菁", "刘佩儒", "陈韦贞", "许台法", "陶志祥", "吴俊宁", "李孟岳", "刘明宪", "吴耀英",
				"陈思桦", "井弘坤", "黄明萍", "陈姿颖", "张成欢", "张燕佳", "李雪鸿", "叶志伟", "王石竹", "孙心桂", "舒大钧", "林秋萍", "柯美惠", "姜上宪", "林欣淳",
				"郭雅娟", "宋采信", "韩贞仪", "李育羽", "冯玟泰", "林姿儒", "蔡敏坤", "林惠玲", "陈珮义", "林书祯", "黄政霖", "谢姿卿" };

		for (int i = 0; i < 40; i++) {
			Users users = new Users();
			users.setUsersid("U" + VeDate.getStringDatex() + VeDate.getRandom() + i);
			users.setUsername("user" + i);
			users.setPassword("user" + i);
			if (i % 2 == 0) {
				users.setSex("男");
				users.setRegdate(VeDate.getNextDay(VeDate.getStringDateShort(), "" + VeDate.getNum(0, i)));
			} else {
				users.setSex("女");
				users.setRegdate(VeDate.getNextDay(VeDate.getStringDateShort(), "-" + VeDate.getNum(0, i)));
			}
			Random rand = new Random();
			int x = rand.nextInt(realname.length - 1);
			users.setRealname(realname[x]);
			users.setBirthday(VeDate.getStringDateShort());
			users.setContact(VeDate.getTel());
			// users.setAddress("" + i);
			usersDAO.insertUsers(users);
		}
	}

}
